nxp-mcuxpresso/mcux-sdk/devices/MIMXRT633S/mcuxpresso/startup_mimxrt633s.cpp
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    SecureFault_Handler,               // The secure fault handler
#if (__ARM_FEATURE_CMSE & 0x2)
    (void (*)())0x180000,                // Image length
#else
    (void (*)())((unsigned)_image_size), // Image length
#endif
    __imghdr_imagetype,                // Image type
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    (void (*)())g_pfnVectors,              // Image load address
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MIMXRT633S_cm33
    WDT0_IRQHandler,             // 16: Windowed watchdog timer 0 (CM33 watchdog)
    DMA0_IRQHandler,             // 17: DMA controller 0 (secure or CM33 DMA)
    GPIO_INTA_IRQHandler,        // 18: GPIO interrupt A
    GPIO_INTB_IRQHandler,        // 19: GPIO interrupt B
    PIN_INT0_IRQHandler,         // 20: Pin interrupt 0 or pattern match engine slice 0 int
    PIN_INT1_IRQHandler,         // 21: Pin interrupt 1 or pattern match engine slice 1 int
    PIN_INT2_IRQHandler,         // 22: Pin interrupt 2 or pattern match engine slice 2 int
    PIN_INT3_IRQHandler,         // 23: Pin interrupt 3 or pattern match engine slice 3 int
    UTICK0_IRQHandler,           // 24: Micro-tick Timer
    MRT0_IRQHandler,             // 25: Multi-Rate Timer
    CTIMER0_IRQHandler,          // 26: Standard counter/timer CTIMER0
    CTIMER1_IRQHandler,          // 27: Standard counter/timer CTIMER1
    SCT0_IRQHandler,             // 28: SCTimer/PWM
    CTIMER3_IRQHandler,          // 29: Standard counter/timer CTIMER3
    FLEXCOMM0_IRQHandler,        // 30: Flexcomm Interface 0 (USART, SPI, I2C, I2S)
    FLEXCOMM1_IRQHandler,        // 31: Flexcomm Interface 1 (USART, SPI, I2C, I2S)
    FLEXCOMM2_IRQHandler,        // 32: Flexcomm Interface 2 (USART, SPI, I2C, I2S)
    FLEXCOMM3_IRQHandler,        // 33: Flexcomm Interface 3 (USART, SPI, I2C, I2S)
    FLEXCOMM4_IRQHandler,        // 34: Flexcomm Interface 4 (USART, SPI, I2C, I2S)
    FLEXCOMM5_IRQHandler,        // 35: Flexcomm Interface 5 (USART, SPI, I2C, I2S)
    FLEXCOMM14_IRQHandler,       // 36: Flexcomm Interface 14 (SPI only)
    FLEXCOMM15_IRQHandler,       // 37: Flexcomm Interface 15 (I2C only)
    ADC0_IRQHandler,             // 38: ADC0
    Reserved39_IRQHandler,       // 39: Reserved interrupt
    ACMP_IRQHandler,             // 40: Analog comparator
    DMIC0_IRQHandler,            // 41: Digital microphone and DMIC subsystem
    Reserved42_IRQHandler,       // 42: Reserved interrupt
    HYPERVISOR_IRQHandler,       // 43: Hypervisor
    SECUREVIOLATION_IRQHandler,  // 44: Secure violation
    HWVAD0_IRQHandler,           // 45: Hardware Voice Activity Detector
    Reserved46_IRQHandler,       // 46: Reserved interrupt
    RNG_IRQHandler,              // 47: Random number Generator
    RTC_IRQHandler,              // 48: RTC alarm and wake-up
    Reserved49_IRQHandler,       // 49: Reserved interrupt
    MU_A_IRQHandler,             // 50: Messaging Unit port A for CM33
    PIN_INT4_IRQHandler,         // 51: Pin interrupt 4 or pattern match engine slice 4 int
    PIN_INT5_IRQHandler,         // 52: Pin interrupt 5 or pattern match engine slice 5 int
    PIN_INT6_IRQHandler,         // 53: Pin interrupt 6 or pattern match engine slice 6 int
    PIN_INT7_IRQHandler,         // 54: Pin interrupt 7 or pattern match engine slice 7 int
    CTIMER2_IRQHandler,          // 55: Standard counter/timer CTIMER2
    CTIMER4_IRQHandler,          // 56: Standard counter/timer CTIMER4
    OS_EVENT_IRQHandler,         // 57: OS event timer
    FLEXSPI_IRQHandler,          // 58: FLEXSPI interface
    FLEXCOMM6_IRQHandler,        // 59: Flexcomm Interface 6 (USART, SPI, I2C, I2S)
    FLEXCOMM7_IRQHandler,        // 60: Flexcomm Interface 7 (USART, SPI, I2C, I2S)
    USDHC0_IRQHandler,           // 61: USDHC0 (Enhanced SDHC) interrupt request
    USDHC1_IRQHandler,           // 62: USDHC1 (Enhanced SDHC) interrupt request
    SGPIO_INTA_IRQHandler,       // 63: Secure GPIO interrupt A
    SGPIO_INTB_IRQHandler,       // 64: Secure GPIO interrupt B
    I3C0_IRQHandler,             // 65: I3C interface 0
    USB_IRQHandler,              // 66: High-speed USB device/host
    USB_WAKEUP_IRQHandler,       // 67: USB Activity Wake-up Interrupt
    WDT1_IRQHandler,             // 68: Windowed watchdog timer 1 (HiFi 4 watchdog)
    USBPHY_DCD_IRQHandler,       // 69: USBPHY DCD
    DMA1_IRQHandler,             // 70: DMA controller 1 (non-secure or HiFi 4 DMA)
    PUF_IRQHandler,              // 71: Physical Unclonable Function
    POWERQUAD_IRQHandler,        // 72: PowerQuad math coprocessor
    CASPER_IRQHandler,           // 73: Casper cryptographic coprocessor
    PMC_PMIC_IRQHandler,         // 74: Power management IC
    HASHCRYPT_IRQHandler,        // 75: Hash-AES unit


}; /* End of g_pfnVectors */

#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void * __VECTOR_TABLE __attribute__ ((alias ("g_pfnVectors")));
void (* __VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

    // Config VTOR & MSPLIM register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    "MSR MSPLIM, %1       \n"
                    :
                    : "r"(g_pfnVectors), "r"(_vStackBase)
                    : "r0", "r1");



#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

